{
    "heading": "About Me",
    "content": [
        {
            "text": "Driven by curiosity and a strong bias for action, I excel at solving complex technical challenges and driving high-impact projects to completion. With deep expertise in system design, distributed architectures, and large-scale automation, I thrive in fast-moving environments that require both strategic thinking and hands-on execution."
        },
        {
            "text": "I have successfully led and optimized mission-critical systems handling millions of transactions per day, from rule-based automation and large-scale document processing to data pipelines and third-party integrations. I have a strong inclination toward automation and actively seek to eliminate repetitive manual processes, ensuring more efficient and scalable workflows."
        },
        {
            "text": "Recently, I automated my new laptop setup using Ansible playbooks. I enjoy starting projects from scratch and delving into the intricate details. When I'm not procrastinating, I blog about my learnings.",
            "links": [
                {
                    "text": "blog",
                    "url": "https://medium.com/@stenzr"
                },
                {
                    "text": "new laptop setup",
                    "url": "https://github.com/stenzr/macbook_developement_setup"
                }
            ]
        },
        {
            "text": "Beyond my core work, I enjoy exploring ways to automate tasks that are important but boring , improving productivity and utilize my time better. My ability to stay calm under pressure enables me to navigate ambiguity, solve intricate problems, and deliver high-performing solutions with speed and precision."
        },
        {
            "text": " I also bring strong team leadership, cross-functional collaboration, and product delivery optimization skills. Whether it's enhancing system performance, solving ambiguous problems, or driving innovation, I focus on building solutions that maximize efficiency, reliability, and long-term impact."
        },
        {
            "text": "In my current role, I design and develop scalable solutions to address and automate challenges faced by legal teams through automated workflows and managing third-party integrations and data migrations"
        },
        {
            "text": "When AFK, I love to ride my Apache RTR 160 4v and explore new places on the road. I'm also a big fan of action and adventure movies and discussing what ifs?."
        },
        {
            "text": "If you find anything interesting, feel free to drop me a Hi! at one of the co-ordinates below. To know more, just keep scrolling...",
            "links": [
                {
                    "text": "co-ordinates below",
                    "url": "#bottom-container"
                }
            ]
        }
    ]
}